final Map<int, String> placeDetails = {
  1: '''Друзья! Чтобы посмотреть все экспонаты Эрмитажа, Вам потребуется 11 лет жизни, если смотреть 8 часов ежедневно, а на осмотр 1 экспоната — 1 минуту.
   Поэтому я предлагаю посмотреть самые известные шедевры Эрмитажа по определенному маршруту: Парадная лестница - Тронный зал - Зал Гобеленов -
    Галерея Отечественной войны 1812 года - Павильонный зал с часами Павлин - Зал да Винчи - Зал Рафаэля - Лоджия Рафаэля - Малый итальянский просвет - 
    Галерея истории древней живописи - Большой итальянский просвет - Малый испанский просвет - Зал Рембранта. Общий маршрут займет около 2,5 часа.
    \n\n**Галерея 1812 года** состоит из 332 портретов русских генералов, участвовавших в Отечественной войне 1812 года, императора Александра I и его союзников.
     Зал, в котором разместилась галерея, создан в 1826 году и был спроектирован архитектором Карлом Росси. Портреты написаны Джорджем Доу и его ассистентами.
      Галерея задумана императором Александром I как прообраз будущего музея воинской славы. Здесь можно увидеть портреты Кутузова, Барклая-де-Толли, Багратиона 
      и других героев войны 1812 года.''',

  2: '''Екатерининский Дворец и парк в Царском Селе
  \n\n"Екатериненские дворцы" есть в Санкт-Петербурге и Таллине, в Москве и в Севастополе. Первые два относятся к эпохе царствования 
  Екатерины I - "каменные палаты Екатерины I" в Царском Селе и дворцовый комплекс барочного типа Катридог в районе
  Кекслинна (Таллин). Вторые два относятся к эпохе Екатерины II -  Екатерининский дворец в Севастополе,
  который был обращен в
о дворец у первого начальника Черноморского флота Мекензи к  приезду в Севастополь Екатерины II в 1787 году,
и построенный в Москве, на месте дворца Анненгоф итальянскими архитекторами Ринальди, Кампорези, Кваренги...
\n\n Безусловно, дворец в Царском Селе был знаковым проектом императорской семьи: ***при Екатерине I*** строительство продолжалось с 1717 года по 1724 год.
В строительстве принимали участие виднейшие архитектурные умы своего времени - немец Иоганн Фридрих Браунштейн при Екатерине I; Первый дворцовый проект представленный широкой публике в присутствии Петра I, участвовавшего в открытии дворца был
достаточно скромен - это было типичное для архитектуры того времени небольшое 2-этажное здание в голландском стиле на 16 помещений.
\n\n ***Императрица Елизавета Петровна*** сформировала уже тот облик дворца, который мы можем наблюдать. Кроме значительного расширения дворца появлялись так же Тронный Зал, церковь, корпуса флигелей.
Кроме того, в дворцовой планировке предпочтение отдавалось "бесконечной анфиладе залов" с перламутровой инкрустацией напольных покрытий из паркета и расписными живописными плафонами на потолках. Многочисленными архитектурными проектами 
по перестройке дворца при Елизавете Петровне заведовали Михаил Григорьевич Земцов, Бартоломео Франческа Растрелли, Андрей Андреевич Квасов и
Савва Иванович Чевакинский; Растрелли лично участвовал в строительстве Золотой Парадной анфилады, которая была декорирована золоченой резьбой.
Дворцовые же фасады Растрелли богато украсил внушительными фигурами атлантов, женскими фигурами кариатид на уровне 2 этажа, а также львиными масками и лепными формами мастера Дункера.
Тогда же возник и полукруглый дворцово-парадный плац. При Елизавете Петровне, в 1755 году в Царскосельский дворец была перенесена
из Зимнего Дворца ***Янтарная комната***, подаренная в 1716 году Петру I королем Фридрихом Вильгельмом I.
\n\n***Большой Зал*** дворца, площадью 800м2, созданный в период 1752-1756 г.г. является самым впечатляющим творением Растрелли.
Окна Зала, выходят на 2 стороны, так как Зал занимает всю ширину дворца. Барочный декор создает иллюзию неограниченного пространства,
где такой эффект усиливается не только живописным плафоном мастера Варелиани на потолке с изображенной на нем колоннадой
и тремя Аллегориями, но и большими окнами Зала, беспрерывным скульпьурным фигурным действом на стенах Зала, и большими встроенными зеркалами...
\n\n Плафон, самый дальний от Антикамер называется "Аллегория Мира". Здесь над пъедесталом стоит торжественный вензель Елизаветы Петровны - "Е I".
Центральная женская фигура олицетворяет Россию, а ангелочки путти держат императорскую корону. Внизу пьедестала женская фигура держит Рог Изобилия.
Справа у корабля показаны символ удачи и возрождения - олень и символ гордости и величия - павлин. Центральный плафон Большого Зала называется "Аллегроия России". Самый ближний к Антикамерам плафон называется "Аллегрия Победы".

\n\n ***Картинный зал*** площадью 180м2 был устроен Елизаветой Петровной для торжественных и дипломатических приемов. Для придания
концентрированности живописных шедевров картины были рпзмещены на стенах Зала по принципу "шпалерной развески". А живописные полотна
мастеров 17-18 в.в. приобретались в западноевропейских столицах специально по заказу Елизаветы Петровны. 
Среди авторов картин: голландский художник Золотого века Адриан Ван Остаде, фламандский художник Давид Тенирс,
голландский живописец Ян Бот, нидерландский рисовальщик Ян Давис де Хем, живописец фламандского барокко Ян Фейт, французский портретист Жан-Марк Натье мл., 
итальянский мастер-живописец батальных сцен Жак Куртуа, знаменитейший мастер "Лука-фа престо" - Лука Джордано,
французский рисовальщик Жак Бланшар... Особое место в Зале занимают картины "Битва при Лесной" и "Полтавская баталия"
работы Пьера-Дени мл.Мартена. Не удивительно, что именно в этом зале в 1757 году состоялся торжественный прием в честь вручения Елизавете Петровне знамен и ключей от
прусских городов, которые Россия завоевала в ходе Семилетней войны (Восточная Пруссия с Кенигсбергом).
\n\n ***Императрица Екатерина II*** немного размыла традицию использовать дворцовый ансамбль в Царском Селе как 
официальную летнюю резиденцию императриц, хотя поручения для обновления внешнего облика все-таки сделала. Екатерина II немало времени проводила в Ораниенбауме,
где у нее был дворец "Павильон катальная Горка", Собственная Дача, любимый ею Китайский Дворец. В царскосельском дворце Екатерина II также произвела некоторые изменения. ***1-ая Антикамера***, 
как собственно 2-я и 3-я Антикамеры соединялись с Юольшим Парадным Залом и в них находились гости, ожидающие выхода императрицы. Освещение Атикамеры 2 рядами окон
было спроектировано архитектором Растрелли. Потолок 1-ой Антикамеры украшает обширный, живописный плафон на античную тему. Работа называется "Триумф Бахуса и Ариадны" работы
живописца венецианской школы Пьетро Градиццы и живописца Антонио Джованни Баттисто Перезинотти. 1-ая Антикамера служила не только представительсктим и официальным целям. В разное время она использовалась и как 
пространство для обычной жизни. Императрица Екатерина II нередко использовала 1-ую Антикамеру для опер, комедий, публичных чтений. в 1765 году здесь для императрицы придворными 
певчими была сыграна французская опера "Летрокер". А в августе 1772 года фрейлинами и придворными кавалерами была сыграна комедия Фонвизина "Бригадир".
\n\n ***3-я Антикамера*** была парадной приемной, самой ближней к Парадной Лестнице в южном крыле дворца. Поэтому высокие гости первым делом попадали в 3-ю Антикамеру.
На живописном плафоне 3-ей Антикамеры представлен также сюжет из античной мифологии - "Олимп" работы итальянского мастера Антонио Джованни Баттисто Перезинотти. Во времена императрицы Екатерины II 
в 3-ей Антикамере был установлен модный в те времена бильярдный стол, в который императрица нередко играла с 2 и 3 игроками. Самый впечатляющий вид на анфиладу парадных 
залов, отделанных золотом  открывался именно из 3-ей Антикамеры. Кроме того, по декоративному оформлению эта Антикамера отличалась от других Антикамер тем, что здесь было установлено целых 4 камина и несколько каннелированных колонн с вертикальными желобками на стволе.
\n\n Екатерину II увлекало античное направление в искусстве, поэтому изменение отделки апартаментов Царскосельского дворца она поручила шотландскому архитектору Камерону, который создал для царицы такие шедевры как Лионская и Арабесовская гостиные, Опочивальню, 
Табакерку (Синий Кабинет), Серебряный кабинет, Купольная столовая. Все эти новые интерьеры отличались утонченностью декоративного оформления и изяществом отделки.
Екатерина II имела не только хорошее образование но и прекрасный вкус. Интересно, что богатые лепные формы своих предшественниц она иронично называла "взбитые сливки". Сделанная Камероном
галерея, примыкающая к дворцу и вовсе оказалась просто непревзойденным творением пространственного решения - тяжеловесный и каменный низ необычным образом превращался в воздушное, наполненное небесной легкостью пространство 2 этажа.
\n\n ***Парадный кабинет Александра I*** был создан архитектором Василием Стасовым для работы императора Александра I и проведения аудиенцией официального характера. Стены кабинета сделаны искусственным 
мрамором и обработаны мастером Щенниковым. Искусственный мрамор являлся популярным в это время отделочным материалом. Камин для Мраморного кабинета (второе название)
был создан скульптором, представителем династии итальянских мастеров по камню Трискорни. Живописец Фридолино Торичели расписал фризы с античными персонажами. После пожара
в Мраморном кабинете в 1821 году стеновая отделка была отреставрирована, а мебель поставили из персидского ореха.Обращает на себя внимание фарфоровая ваза Императорского завода где изображен Александр  I, 
торжественно въезжающий в 1814 году в Париж. На столе Александра I находятся письменный прибор и пресс-папье из малахита. ***Рабочий кабинет Александра I*** предназначался для повседневной работы.
На стене висел портрет любимой сестры Екатерины Павловны и друга, прусского короля Фридриха Вильгельма III.
\n\n ***Опочивальня Александра I*** первоначально строилась архитектором Растрелли для Елизаветы Петровны. Однако окончательная отделка завершена здесь при Екатерине II. 
В 1782 году императрица передала Опочивальню любимому внуку Александру. Наверное стены "впитали" теплое отношение бабушки к родному человеку, поэтому Александр I 
до конца жизни относился к этому месту как к чему-то "одушевленному". Перед отъездом в Таганрог 30 августа 1825 года император останавливался здесь в последний раз. Обращает внимание,
 что убранство Опочивальни скромное. Кресла, стулья, комоды из красного дерева. Одиноко стоящая кровать, походного плана в углу. К тому же складная, из деревянного каркаса. Для изголовья откидывались сьальные перекладины. 
 Тент из грубого полотна, который обшит кожей. Кожаный матрац набитый соломой. Две небольшие подушки из алого и зеленого сафьяна. 
 \n\n ***Зеленая столовая*** с покоями великого князя Павла Петровича и его супруги Марии Федоровны возникла на месте растреллевского висячего сада. 
 Архитектором выступил Василий Неелов, а внутренним архитектурным обликом занимался Камерон, который оформил стены изящными античными фигурами юношей и девушек,
 медальонами с танцующими амурами, композициями на мифологические сюжеты, дверьми с гротескными орнаментами...
 \n\n ***Павильон "Грот"*** у озера спроектировал по личному распоряжению Елизаветы Петровны архитектор Растрелли. Павильон предстает перед посетителями в прекрасных светло-голубых 
 оттенках, с золотыми решетками и обилием резных масок на фасаде и лепных аллегорических форм. Здесь и нептун, и морские тритоны, изображения дельфинов, раковин и морских растений...
 \n\n ***Турецкая Баня*** расположена на противоположном от Павильона "Грот" берегу Большого пруда. Эта постройка восточного типа с позолоченным куполом и примыкающим 
 к ней минаретом выделяется среди построек Царского Села. Интересно, что тематическая постройка с рельефными восточными орнаментами посвящена военным победам России над турками.
 Хотя первоначально на этом месте по замыслу 1791 года Екатерины II должна была возникнуть Турецкая баня. Ее внук Николай I трансформировал проект бабушки в 
 экзотический павильон на берегу озера, который был посвящен победе русских в Русска-Турецкой войне 1828-1829 г.г. и подписанию Анриапольскому мирному договору, по которому 
 России присоединялись Анапа и Поти, восстанавливалась российская торговая навигация в проливах Черного моря и ликвидировались некоторые турецкие крепости на Дунае. 
 Место для постройки павильона определил сам император Николай I. Первоначальный эскиз постройки, сделанный Карлом Росси (сделанный им в 1848 с бани гарема Старого дворца в Эдирне) 
 впоследствии по распоряжению императора доработал молодоой архитектор Ипполит Монигетти. Построен павильнон был в 1852 году.
 \n\n ***Чесменская колонна*** - дорическая колонна из мрамора, возвышающаяся в центре Большого пруда Екатериненского парка является его яркой доминантой. 
 Императрица Екарина II поручила знаменитому архитектору  Антоио Ринальди спроектировать и воздвигнуть внушительную колонну в честь 3 побед русского флота в Русско-Турецкой войне
 1768-1774 г.г.: Чесменской, Хиосской и Митиленской. Строительство продолжалось в период 1774-1778 г.г. Эти сражения отличали высочайший боевой дух в русском флоте, за счет чего 
 победа была одержана над значительно превосходящими силами турецкого паши Жефир-Бея. Поэтому не случайно, что увенчана колонна орлом, попирающим полумесяц. 
 На сером мраморном пъедестале находятся бронзовые барельефы на которых изображены главные морские сражения в этой войне. Сама колонна стоит на стилобате из гранита.
 Стилобат в форме пирамиды поднимается прямо из воды, а в центральной ее части сделана за решетчатая арка с каменной лестницей, которая ведет к пъедесталу.
\n\n***"Камеронова галерея"*** представляет собой настоящий шедевр искусства архитектуры, это двухэтажное сооружение является составной части ансамбля "Агатового павильона", 
Холодных бань, Пандуса и Висячего сада. Свое название галерея получиав 1885 году, когда историк искусства и библиограф Петров в одной из статей в журнале "Зодчий" 
назвал "Камероновой галереей" это выдающееся сооружение. Приехавший в 1779 году в Россию англичанин Камерон, начал воплощать замысел Екатерины II создать собирательный образ из греческих и римских шедвевров Архитектуры. 
\n\n Отделочным материалом первого этажа, подчеркивающего его тяжеловесность был пудотский камень. При этом оконные проемы первого этажа были немаленькие. 
Нижний, тяжеловесный этаж являлся основанием для легких, белых 44 колон с изящными ионическими капителями 2-го этажа. Воздущность и легкость 2-му этажу придают 
светлые тона, просторные террасы по всей длине 2-го этажа и отодвинутые от края окна с увеличенными оконными проемами. Таким образом, галерея наглядно демонстрировала 
филосовское воплощение извечного главного вопроса бытия о тяжеловесности и бренности материи и воздушности и легкости духа...
\n\n ***Екатерининский парк*** состоит из 2 частей: пейзажного Английского парка и регулярного Старого (Голландского) сада, основанного, по преданию, самим Петром I. 
Журналист Павел Свиньин указывал, что Петр I собственноручно насадил платановые и дубовые аллеи. В результате голландские мастера садово-паркового дела Роозен и Фохт распланировали в 
1720-х годах Старый сад на 3 уступах перед царицыным дворцом. На 3-ем уступе в это же время были устроены Зеркальные пруды. На речке же Вангазе, стекавшей с холма, - еще 2 пруда: 
Мельничный, вошедший в систему Каскадных прудов и Верхний (Большой). В середине XVIII века Растрелли спроектировал павильоны "Эрмитаж" и "Грот", а также Катальную гору; 
Большой пруд с расположенным на острове увеселительным павильоном


 ''', 
  
  3: 'Подробное описание Лахта центра...', 
  
  4: 'Подробное описание квартиры Пушкина...', 
  
  5: 'Подробное описание Александровской колонны...', 
  
  6: '''Часовня Ксении Петербургской находится на Смоленском кладбище и является одним из самых почитаемых мест в Санкт-Петербурге. Блаженная Ксения Петербургская - святая, жившая в XVIII веке, которая после смерти мужа раздала все имущество и приняла на себя подвиг юродства. Она помогала людям при жизни и продолжает помогать после смерти. К часовне постоянно приходят верующие, чтобы помолиться и попросить помощи у святой Ксении. На стенах часовни можно увидеть множество благодарственных записок от тех, кому она помогла.''',
  
  7: 'Подробное описание квартиры Достоевского...',
  
  8: 'Подробное описание Михайловского замка...',
  
  9: 'Подробное описание Летнего сада...',
  
  10: 'Подробное описание Медного всадника...',
  
  11: 'Подробное описание Смольного собора...',
  
  12: '''Грифоны на Банковском мосту - одни из самых известных скульптур в Санкт-Петербурге. Мост был построен в 1825-1826 годах по проекту инженера Г. Треттера. Скульптуры грифонов с золотыми крыльями созданы скульптором П. Соколовым. Согласно мифам, грифоны охраняют золото, поэтому их часто изображают у банков. Существует поверье, что если потереть лапу грифона или положить монетку ему под лапу, то это принесет финансовую удачу.''',
  
  13: 'Подробное описание Зимней канавки...',
  
  14: 'Подробное описание магазина Елисеевых...',
  
  15: 'Подробное описание Казанского собора...',
  
  16: 'Подробное описание Исаакиевского собора...',
  
  17: 'Подробное описание Ростральных колонн...',
  
  18: 'Подробное описание Юсуповского дворца...',
  
  19: 'Подробное описание здания Думы...',
  
  20: '''Петропавловский собор - усыпальница российских императоров от Петра I до Николая II. Собор был построен в 1712-1733 годах по проекту архитектора Доменико Трезини. Его колокольня со шпилем является самым высоким архитектурным сооружением в историческом центре Петербурга. Здесь похоронены почти все российские императоры и императрицы от Петра I до Александра III, а также члены их семей. В 1998 году здесь были перезахоронены останки последнего императора Николая II и его семьи.''',
  
  21: 'Подробное описание Александро-Невской Лавры...',
  
  22: 'Подробное описание коней Клодта...',
  
  23: 'Подробное описание Спаса на Крови...',
  
  24: 'Подробное описание Дома Зингер...',
  
  25: 'Подробное описание Марсова поля...',
  
  26: 'Подробное описание музея Ахматовой...',
  
  27: 'Подробное описание Атлантов...',
  
  28: 'Подробное описание Владимирского собора...',
  
  29: 'Подробное описание Адмиралтейства...',
  
  30: 'Подробное описание Национальной библиотеки...',
  
  31: 'Подробное описание Литераторских мостков...',
  
  32: '''Домик Петра I - самое первое здание в Санкт-Петербурге, построенное в 1703 году для царя Петра I. Это небольшая деревянная изба, срубленная из тесаных сосновых бревен и раскрашенная под кирпич. Несмотря на скромные размеры, домик состоит из двух комнат, разделенных сенями и кабинетом. Здесь Петр I жил в первые годы строительства города. Сейчас это музей, где можно увидеть личные вещи царя и предметы той эпохи.''',
};